---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LockAlignmentUiToggle
source: html/cee2b8b6-159e-77c1-07dc-a98199a07667.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LockAlignmentUiToggle Property

"Lock": This is used by the UI to allow selection of lock alignment.

## Syntax (C#)
```csharp
public static ForgeTypeId LockAlignmentUiToggle { get; }
```